
## Plan Result (terraform/main)

[CI link](https://github.com/kaz-under-the-bridge/my-cloud-iac-aws/actions/runs/22183912812)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_eip.ouchi_relay
* Replace
  * aws_instance.ouchi_relay


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_eip.ouchi_relay will be updated in-place
  ~ resource "aws_eip" "ouchi_relay" {
        id                       = "eipalloc-02e0ea522cbfc8616"
      ~ instance                 = "i-0e0dec97b7045fa34" -> (known after apply)
        tags                     = {
            "Name"    = "ouchi-relay"
            "Purpose" = "reverse-ssh-tunnel-relay"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_instance.ouchi_relay must be replaced
-/+ resource "aws_instance" "ouchi_relay" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:279586433649:instance/i-0e0dec97b7045fa34" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e0dec97b7045fa34" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0266dd4e6c059f5c1" -> (known after apply)
      ~ private_dns                          = "ip-172-31-40-132.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.40.132" -> (known after apply)
      ~ public_dns                           = "ec2-52-197-246-226.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.197.246.226" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "ouchi-relay-sg",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-02c1c001f481315c7" -> (known after apply)
        tags                                 = {
            "Name"    = "ouchi-relay"
            "Purpose" = "reverse-ssh-tunnel-relay"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "b90f18bda6d52bd67556c9cc990c3d0583f549e9" -> "8ca214c1344f7736e51ab2c2468c597324b50b88" # forces replacement
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 2 -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ap-northeast-1:279586433649:key/4e76c677-7655-452a-8af5-2dea730d14fc" -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {
              - "Environment" = "production"
              - "Project"     = "my-cloud-iac-aws"
              - "Terraform"   = "true"
            } -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-092b7fdba9c26ae9f" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"15fdd8b673e54cee994c79987b9a799b50c7de05","Target":"terraform/main","Vars":{},"WorkflowName":"pull_request_target"} -->